**let us understand concatination**

In [ ]:
import pandas as pd
df1 = pd. DataFrame({'Item':['A','B','C','D'],
                     'Value':[1,2,3,4]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'value':[5,6,7,8]})
print(df1)
print(df2)

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      4
  Item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
df2

  Item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
pd.concat([df1,df2])

  Item  Value  value
0    A    1.0    NaN
1    B    2.0    NaN
2    C    3.0    NaN
3    D    4.0    NaN
0    E    NaN    5.0
1    F    NaN    6.0
2    G    NaN    7.0
3    H    NaN    8.0

In [ ]:
import pandas as pd
df1 = pd. DataFrame({'Item':['A','B','C','D'],
                     'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'value':[6,7,8,9]})
print(df1)
print(df2)

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      5
  Item  value
0    E      6
1    F      7
2    G      8
3    H      9

In [ ]:
pd.concat([df1,df2])

  Item  Value  value
0    A    1.0    NaN
1    B    2.0    NaN
2    C    3.0    NaN
3    D    5.0    NaN
0    E    NaN    6.0
1    F    NaN    7.0
2    G    NaN    8.0
3    H    NaN    9.0

In [ ]:
import pandas as pd
df1 = pd. DataFrame({'Item':['A','B','C','D'],
                     'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity':[6,7,8,9]})
pd.concat([df1,df2])

  Item  Value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    5.0       NaN
0    E    NaN       6.0
1    F    NaN       7.0
2    G    NaN       8.0
3    H    NaN       9.0

In [ ]:
import pandas as pd
df1 = pd. DataFrame({'Item':['A','B','C','D'],
                     'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity':[6,7,8,9]})
pd.concat([df1,df2]).reset_index()

   index Item  Value  Quantity
0      0    A    1.0       NaN
1      1    B    2.0       NaN
2      2    C    3.0       NaN
3      3    D    5.0       NaN
4      0    E    NaN       6.0
5      1    F    NaN       7.0
6      2    G    NaN       8.0
7      3    H    NaN       9.0

In [ ]:
pd.concat([df1,df2], axis=1)

  Item  Value Item  Quantity
0    A      1    E         6
1    B      2    F         7
2    C      3    G         8
3    D      5    H         9

**use append to add multiple dataframes to another**

In [ ]:
import pandas as pd
df1 = pd. DataFrame({'Item':['A','B','C','D'],
                     'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity':[6,7,8,9]})
df3 = pd.DataFrame({'Item':['I','J','K','L'],
                    'Quantity':[3,7,4,25]})
df1.append([df2,df3])

  Item  Value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    5.0       NaN
0    E    NaN       6.0
1    F    NaN       7.0
2    G    NaN       8.0
3    H    NaN       9.0
0    I    NaN       3.0
1    J    NaN       7.0
2    K    NaN       4.0
3    L    NaN      25.0

In [ ]:

dfA = pd. DataFrame({'key':['A','B','C','D'],
                     'A':[1,2,3,5]})
dfB = pd.DataFrame({'key':['E','F','G','H'],
                    'B':[6,7,8,9]})
pd.merge(dfA,dfB,on='key')

Empty DataFrame
Columns: [key, A, B]
Index: []

In [ ]:

dfA = pd. DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'], 
                     'B':['B0','B1','B2','B3']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
dfA
#pd.merge(dfA,dfB,on='key')

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
fA = pd. DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'], 
                     'B':['B0','B1','B2','B3']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
dfB
#pd.merge(dfA,dfB,on='key')d

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [ ]:
dfA = pd. DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'], 
                     'B':['B0','B1','B2','B3']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
pd.merge(dfA,dfB,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
dfA = pd. DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'], 
                     'B':['B0','B1','B2','B3']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
pd.merge(dfA,dfB,how = 'inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

**joining**

In [ ]:
left =pd.DataFrame({'A':['K0','K1','K2','K3'],
                     'B':['A0','A1','A2','A3']}, 
                     index = ['B0','B1','B2','B3'])

In [ ]:
left

     A   B
B0  K0  A0
B1  K1  A1
B2  K2  A2
B3  K3  A3

In [ ]:
Right =pd.DataFrame({'A':['K0','K1','K2','K3'],
                     'B':['A0','A1','A2','A3']}, 
                     index = ['B0','B1','B2','B3'])
Right

     A   B
B0  K0  A0
B1  K1  A1
B2  K2  A2
B3  K3  A3

In [ ]:
left =pd.DataFrame({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2']},
                     index = ['K0','K1','K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right =pd.DataFrame({'C':['C0','C1','C2'],
                     'D':['D0','D1','D2']}, 
                     index = ['K0','K1','K2'])
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [ ]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [ ]:
left.join(right,how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [ ]:
#python program for finding H.C.F of two input numbers
def computeHCF(x,y): 

#choose the smaller number
     if x>y:
         smaller = y 
     else:
        smaller = x
     for i in range (1,smaller+1):
        if ((x % i ==0)and(y % i ==0 )):
          hcf=i

          return hcf

num1 = int(input("enter first number"))
num2 = int(input("enter second number"))

print("The H.C.F of",num1,"and",num2,"is",computeHCF(num1,num2))